zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW235/MCXW235_COMMON.h
/* PUF - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral PUF base address */
  #define PUF_BASE                                 (0x5003B000u)
  /** Peripheral PUF base address */
  #define PUF_BASE_NS                              (0x4003B000u)
  /** Peripheral PUF base pointer */
  #define PUF                                      ((PUF_Type *)PUF_BASE)
  /** Peripheral PUF base pointer */
  #define PUF_NS                                   ((PUF_Type *)PUF_BASE_NS)
  /** Array initializer of PUF peripheral base addresses */
  #define PUF_BASE_ADDRS                           { PUF_BASE }
  /** Array initializer of PUF peripheral base pointers */
  #define PUF_BASE_PTRS                            { PUF }
  /** Array initializer of PUF peripheral base addresses */
  #define PUF_BASE_ADDRS_NS                        { PUF_BASE_NS }
  /** Array initializer of PUF peripheral base pointers */
  #define PUF_BASE_PTRS_NS                         { PUF_NS }
#else
  /** Peripheral PUF base address */
  #define PUF_BASE                                 (0x4003B000u)
  /** Peripheral PUF base pointer */
  #define PUF                                      ((PUF_Type *)PUF_BASE)
  /** Array initializer of PUF peripheral base addresses */
  #define PUF_BASE_ADDRS                           { PUF_BASE }
  /** Array initializer of PUF peripheral base pointers */
  #define PUF_BASE_PTRS                            { PUF }
#endif
/** Interrupt vectors for the PUF peripheral type */
#define PUF_IRQS                                 { PUF_IRQn }

/* PUF_SRAM_CTRL - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral PUF_SRAM_CTRL base address */
  #define PUF_SRAM_CTRL_BASE                       (0x5003B000u)
  /** Peripheral PUF_SRAM_CTRL base address */
  #define PUF_SRAM_CTRL_BASE_NS                    (0x4003B000u)
  /** Peripheral PUF_SRAM_CTRL base pointer */
  #define PUF_SRAM_CTRL                            ((PUF_SRAM_CTRL_Type *)PUF_SRAM_CTRL_BASE)
  /** Peripheral PUF_SRAM_CTRL base pointer */
  #define PUF_SRAM_CTRL_NS                         ((PUF_SRAM_CTRL_Type *)PUF_SRAM_CTRL_BASE_NS)
  /** Array initializer of PUF_SRAM_CTRL peripheral base addresses */
  #define PUF_SRAM_CTRL_BASE_ADDRS                 { PUF_SRAM_CTRL_BASE }
  /** Array initializer of PUF_SRAM_CTRL peripheral base pointers */
  #define PUF_SRAM_CTRL_BASE_PTRS                  { PUF_SRAM_CTRL }
  /** Array initializer of PUF_SRAM_CTRL peripheral base addresses */
  #define PUF_SRAM_CTRL_BASE_ADDRS_NS              { PUF_SRAM_CTRL_BASE_NS }
  /** Array initializer of PUF_SRAM_CTRL peripheral base pointers */
  #define PUF_SRAM_CTRL_BASE_PTRS_NS               { PUF_SRAM_CTRL_NS }
#else
  /** Peripheral PUF_SRAM_CTRL base address */
  #define PUF_SRAM_CTRL_BASE                       (0x4003B000u)
  /** Peripheral PUF_SRAM_CTRL base pointer */
  #define PUF_SRAM_CTRL                            ((PUF_SRAM_CTRL_Type *)PUF_SRAM_CTRL_BASE)
  /** Array initializer of PUF_SRAM_CTRL peripheral base addresses */
  #define PUF_SRAM_CTRL_BASE_ADDRS                 { PUF_SRAM_CTRL_BASE }
  /** Array initializer of PUF_SRAM_CTRL peripheral base pointers */
  #define PUF_SRAM_CTRL_BASE_PTRS                  { PUF_SRAM_CTRL }
#endif

/* RADIO - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral RADIO base address */
  #define RADIO_BASE                               (0x500B0000u)
  /** Peripheral RADIO base address */
  #define RADIO_BASE_NS                            (0x400B0000u)
  /** Peripheral RADIO base pointer */
  #define RADIO                                    ((RADIO_Type *)RADIO_BASE)
  /** Peripheral RADIO base pointer */
  #define RADIO_NS                                 ((RADIO_Type *)RADIO_BASE_NS)
  /** Array initializer of RADIO peripheral base addresses */
  #define RADIO_BASE_ADDRS                         { RADIO_BASE }
  /** Array initializer of RADIO peripheral base pointers */
  #define RADIO_BASE_PTRS                          { RADIO }
  /** Array initializer of RADIO peripheral base addresses */
  #define RADIO_BASE_ADDRS_NS                      { RADIO_BASE_NS }
  /** Array initializer of RADIO peripheral base pointers */
  #define RADIO_BASE_PTRS_NS                       { RADIO_NS }
#else
  /** Peripheral RADIO base address */
  #define RADIO_BASE                               (0x400B0000u)
  /** Peripheral RADIO base pointer */
  #define RADIO                                    ((RADIO_Type *)RADIO_BASE)
  /** Array initializer of RADIO peripheral base addresses */
  #define RADIO_BASE_ADDRS                         { RADIO_BASE }
  /** Array initializer of RADIO peripheral base pointers */
  #define RADIO_BASE_PTRS                          { RADIO }
#endif

/* ROMCP - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral ROMCP base address */
  #define ROMCP_BASE                               (0x5003E000u)
  /** Peripheral ROMCP base address */
  #define ROMCP_BASE_NS                            (0x4003E000u)
  /** Peripheral ROMCP base pointer */
  #define ROMCP                                    ((ROMCP_Type *)ROMCP_BASE)
  /** Peripheral ROMCP base pointer */
  #define ROMCP_NS                                 ((ROMCP_Type *)ROMCP_BASE_NS)
  /** Array initializer of ROMCP peripheral base addresses */
  #define ROMCP_BASE_ADDRS                         { ROMCP_BASE }
  /** Array initializer of ROMCP peripheral base pointers */
  #define ROMCP_BASE_PTRS                          { ROMCP }
  /** Array initializer of ROMCP peripheral base addresses */
  #define ROMCP_BASE_ADDRS_NS                      { ROMCP_BASE_NS }
  /** Array initializer of ROMCP peripheral base pointers */
  #define ROMCP_BASE_PTRS_NS                       { ROMCP_NS }
#else
  /** Peripheral ROMCP base address */
  #define ROMCP_BASE                               (0x4003E000u)
  /** Peripheral ROMCP base pointer */
  #define ROMCP                                    ((ROMCP_Type *)ROMCP_BASE)
  /** Array initializer of ROMCP peripheral base addresses */
  #define ROMCP_BASE_ADDRS                         { ROMCP_BASE }
  /** Array initializer of ROMCP peripheral base pointers */
  #define ROMCP_BASE_PTRS                          { ROMCP }
#endif

/* RTC - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral RTC base address */
  #define RTC_BASE                                 (0x5002C000u)
  /** Peripheral RTC base address */
  #define RTC_BASE_NS                              (0x4002C000u)
  /** Peripheral RTC base pointer */
  #define RTC                                      ((RTC_Type *)RTC_BASE)
  /** Peripheral RTC base pointer */
  #define RTC_NS                                   ((RTC_Type *)RTC_BASE_NS)
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS                           { RTC_BASE }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS                            { RTC }
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS_NS                        { RTC_BASE_NS }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS_NS                         { RTC_NS }
#else
  /** Peripheral RTC base address */
  #define RTC_BASE                                 (0x4002C000u)
  /** Peripheral RTC base pointer */
  #define RTC                                      ((RTC_Type *)RTC_BASE)
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS                           { RTC_BASE }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS                            { RTC }
#endif
/** Interrupt vectors for the RTC peripheral type */
#define RTC_IRQS                                 { RTC_IRQn }

/* SCT - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral SCT0 base address */
  #define SCT0_BASE                                (0x50085000u)
  /** Peripheral SCT0 base address */
  #define SCT0_BASE_NS                             (0x40085000u)
  /** Peripheral SCT0 base pointer */
  #define SCT0                                     ((SCT_Type *)SCT0_BASE)
  /** Peripheral SCT0 base pointer */
  #define SCT0_NS                                  ((SCT_Type *)SCT0_BASE_NS)
  /** Array initializer of SCT peripheral base addresses */
  #define SCT_BASE_ADDRS                           { SCT0_BASE }
  /** Array initializer of SCT peripheral base pointers */
  #define SCT_BASE_PTRS                            { SCT0 }
  /** Array initializer of SCT peripheral base addresses */
  #define SCT_BASE_ADDRS_NS                        { SCT0_BASE_NS }
  /** Array initializer of SCT peripheral base pointers */
  #define SCT_BASE_PTRS_NS                         { SCT0_NS }
#else
  /** Peripheral SCT0 base address */
  #define SCT0_BASE                                (0x40085000u)
  /** Peripheral SCT0 base pointer */
  #define SCT0                                     ((SCT_Type *)SCT0_BASE)
  /** Array initializer of SCT peripheral base addresses */
  #define SCT_BASE_ADDRS                           { SCT0_BASE }
  /** Array initializer of SCT peripheral base pointers */
  #define SCT_BASE_PTRS                            { SCT0 }
#endif
/** Interrupt vectors for the SCT peripheral type */
#define SCT_IRQS                                 { SCT0_IRQn }

